Repository: nohasamir2918/training-sector1
Catalog: TrainigSectorWebSite/Resources/SharedResource.*.resx
Languages: ar

source: Projects
ar: المشروعات

# historyMinister
source: A brief history of the Leadership Preparation Center
ar: نبذة تاريخية عن مركز اعداد القادة

# TainingCourses
source: Training Courses
ar: دورات تدريبية

source: Training Course Name
ar: أسم الدورة التدريبية

source: Workshops and laboratories
ar: الورش والمعامل

source: Job Conduct
ar: السلوك الوظيفي

source: Our Services
ar: خدماتنا

source: Courses
ar: دورات

source: Theater
ar: مسرح

source: Halls
ar: قاعات

source: Educational Facilities
ar: المنشأت التعليمية

source: Advanced Technical Institute for Industries
ar: المعهد الفني للصناعات المتطورة

source: Historical Overview
ar: نبذة تاريخية

source: Departments Divisions
ar: الأقسام والشعب

source: Mechanical Division
ar: شعبة الميكانيكا

source: Electrical Electronics Division
ar: شعبة الكهرباء والإلكترونيات

source: Computer Division
ar: شعبة الحاسبات

source: Chemistry Division
ar: شعبة الكيمياء

source: Basic Sciences Division
ar: شعبة العلوم الأساسية

source: Mechatronics Division
ar: شعبة ميكاترونيكس

source: Labs Workshops
ar: المعامل و الورش

source: Student Services
ar: خدمات طلابية

source: Study Schedules
ar: الجداول الدراسية

source: Exam Schedules
ar: جداول إمتحانات

source: Student Activities
ar: أنشطة طلابية

source: Announcements Alerts
ar: إعلانات وتنبيهات

source: Student Results
ar: نتائج الطلاب

source: Quality
ar: الجودة

source: Technological College
ar: الكلية التكنولوجيه

source: Campus Departments
ar: أقسام المجمع

source: Helwan Secondary School for Applied Technology
ar: مدرسة حلوان الثانوية للتكنولوجيا التطبيقية

source: School Departments
ar: أقسام المدرسة

source: El-Salam Applied Technology Secondary School
ar: مدرسة الثانوية للتكنولوجيا التطبيقية بالسلام

source: Training Facilities
ar: المنشأت التدريبية

source: Leadership Development Center
ar: مركز إعداد القادة

source: Training Courses
ar: الدورات التدريبية

source: Labs
ar: معامل

source: Engineering Labs
ar: معامل هندسية

source: Chemical Labs
ar: معامل كميائية

source: Workshops
ar: ورش

source: Production Engineering Workshops
ar: ورش هندسة الإنتاج

source: Ministry of Military Production
ar: وزارة الإنتاج الحربي

source: Ministry of Higher Education
ar: وزارة التعليم العالي

source: Ministry of Education
ar: وزارة التربية والتعليم

source: Egyptian Academy for Engineering
ar: الأكاديمية المصرية للهندسة

source: Quick Navigation
ar: التصفح السريع

source: Community Participation
ar: مشاركات مجتمعية

source: News
ar: الأخبار

source: Complaints Suggestions
ar: شكاوي ومقترحات

source: Contact Us
ar: اتصل بنا

source: Training Courses Guide
ar: دليل الدورات التدريبية

source: Success Story
ar: قصة نجاح

source: MainPage
ar: الصفحة الرئيسية

source: Training History
ar: نبذة تاريخية
